<?php
/**
 * Шаблон комплексного компонента bitrix:catalog - invest_catalog
 * Контроллер для детальной страницы (element.php)
 * 
 * ЗАГЛУШКА С 404 ОШИБКОЙ
 * Контентные инфоблоки не имеют детальных страниц
 */

if (!defined("B_PROLOG_INCLUDED") || B_PROLOG_INCLUDED !== true)
    die();

use Bitrix\Iblock\Component\Tools;

// ====================================================================
// ВОЗВРАТ 404 ОШИБКИ
// ====================================================================
// Детальные страницы для контентных инфоблоков не предусмотрены
// ====================================================================

Tools::process404(
    "Страница не найдена",   // Сообщение
    true,                     // Установить статус 404
    true,                     // Показать страницу 404
    true,                     // Показать сообщение
    false                     // Ссылка на главную
);
?>